


export default function Line() {
  return (
  
    <div className="bg-[#5C3E32] text-white py-2.5 px-3 w-full whitespace-nowrap overflow-hidden">
      <div className="flex animate-scroll">
        <span span className="flex space-x-7">
          <span>🔥 تخفيضات بمناسبة فتح المتجر  </span>
          <span> ❤️خصومات تصل الى 20%</span>
          <span>🔥 تخفيضات بمناسبة فتح المتجر  </span>
          <span> ❤️خصومات تصل الى 20%</span>
          <span>🔥 تخفيضات بمناسبة فتح المتجر  </span>
          <span> ❤️خصومات تصل الى 20%</span>
          <span>🔥 تخفيضات بمناسبة فتح المتجر  </span>
          <span> ❤️خصومات تصل الى 20%</span>
          <span>🔥 تخفيضات بمناسبة فتح المتجر  </span>
          <span> ❤️خصومات تصل الى 20%</span>
          <span>🔥 تخفيضات بمناسبة فتح المتجر  </span>
          <span> ❤️خصومات تصل الى 20%</span>
          <span>🔥 تخفيضات بمناسبة فتح المتجر  </span>
          <span> ❤️خصومات تصل الى 20%</span>
          <span>🔥 تخفيضات بمناسبة فتح المتجر  </span>
          <span> ❤️خصومات تصل الى 20%</span>
          <span>🔥 تخفيضات بمناسبة فتح المتجر  </span>
          <span> ❤️خصومات تصل الى 20%</span>
          <span>🔥 تخفيضات بمناسبة فتح المتجر  </span>
          <span> ❤️خصومات تصل الى 20%</span>
          <span>🔥 تخفيضات بمناسبة فتح المتجر  </span>
          <span> ❤️خصومات تصل الى 20%</span>
          <span>🔥 تخفيضات بمناسبة فتح المتجر  </span>
          <span> ❤️خصومات تصل الى 20%</span>
          <span>🔥 تخفيضات بمناسبة فتح المتجر  </span>
          <span> ❤️خصومات تصل الى 20%</span>
        
        </span>
       
      </div>
    </div>
  )
}
